-- ######################
-- 1. Какая общая сумма оплаченных заказов?
-- ######################


-- ######################
-- 2. Сумма заказов по пользователям.
-- У каких пользователей не было заказов?
-- ######################


-- ######################
-- 3. У каких поставщиков нет заказов?
-- ######################


-- ######################
-- Получить в 1 запросе следующие данные:
-- сумму заказов, сделанных в определенный период c 2023-04-25 по 2023-05-01
-- данные по тем клиентам, которые сделали эти заказы (name и email)
-- Сведения о доставке (date и price)
-- товары входящие в состав заказа, их количество (name из product, quantity из order_product)
-- сведения о поставщике этих товаров (name и phone)
-- ######################
